[Timeout] BlockStatement
src/pages/Login/LoginForm.js:7:46
 import './LoginForm.css';
 
 
-async function postLogin(url = '', data= {}) {
-  console.log(JSON.stringify(data))
-  await fetch(url, {
-    method: 'POST',
-    headers: {
-      "Content-type": "application/json; charset=UTF-8"
-    },
-    body: JSON.stringify(data)
-  }).then(response => {
-    console.log(response)
-    return response.ok
-  }).catch(err => {
-    console.log(err)
-    return false
-  })
-
-}
+async function postLogin(url = '', data= {}) {}
 
 //Cria a página de Login

[Timeout] StringLiteral
src/pages/Login/LoginForm.js:7:32
 import './LoginForm.css';
 
 
-async function postLogin(url = '', data= {}) {
+async function postLogin(url = "Stryker was here!", data= {}) {
   console.log(JSON.stringify(data))
   await fetch(url, {

[Timeout] BlockStatement
src/pages/Login/LoginForm.js:15:23
       "Content-type": "application/json; charset=UTF-8"
     },
     body: JSON.stringify(data)
-  }).then(response => {
-    console.log(response)
-    return response.ok
-  }).catch(err => {
+  }).then(response => {}).catch(err => {
     console.log(err)
     return false

[Timeout] BlockStatement
src/pages/Login/LoginForm.js:18:19
   }).then(response => {
     console.log(response)
     return response.ok
-  }).catch(err => {
-    console.log(err)
-    return false
-  })
+  }).catch(err => {})
 
 }

[Timeout] BooleanLiteral
src/pages/Login/LoginForm.js:20:12
     return response.ok
   }).catch(err => {
     console.log(err)
-    return false
+    return true
   })
 

[Timeout] StringLiteral
src/pages/Login/LoginForm.js:30:38
   const dispatch = useDispatch();
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
-  const [error, setError] = useState("");
+  const [error, setError] = useState("Stryker was here!");
 
   const handleSubmit = (event) => {

[Timeout] BlockStatement
src/pages/Login/LoginForm.js:32:35
   const [password, setPassword] = useState("");
   const [error, setError] = useState("");
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    if (postLogin("http://localhost:4000/users/authenticate",{email,password})) {
-      handleLogin();
-    }
-  };
+  const handleSubmit = (event) => {};
 
   return (

[Timeout] BlockStatement
src/pages/Login/LoginForm.js:34:81
 
   const handleSubmit = (event) => {
     event.preventDefault();
-    if (postLogin("http://localhost:4000/users/authenticate",{email,password})) {
-      handleLogin();
-    }
+    if (postLogin("http://localhost:4000/users/authenticate",{email,password})) {}
   };
 

[Timeout] ConditionalExpression
src/pages/Login/LoginForm.js:34:9
 
   const handleSubmit = (event) => {
     event.preventDefault();
-    if (postLogin("http://localhost:4000/users/authenticate",{email,password})) {
+    if (true) {
       handleLogin();
     }

[Timeout] ArrowFunction
src/pages/Login/LoginForm.js:46:21
         <input
           type="email"
           value={email}
-          onChange={(event) => setEmail(event.target.value)}
+          onChange={() => undefined}
           required
         />

[Timeout] ArrowFunction
src/pages/Login/LoginForm.js:56:21
         <input
           type="password"
           value={password}
-          onChange={(event) => setPassword(event.target.value)}
+          onChange={() => undefined}
           required
         />

[Timeout] LogicalOperator
src/pages/Login/LoginForm.js:61:8
         />
       </label>
       <br />
-      {error && <div style={{ color: "red" }}>{error}</div>}
+      {error || <div style={{
+  color: "red"
+}}>{error}</div>}
       <button type="submit">Login</button>
     </form>

[Timeout] ConditionalExpression
src/pages/Login/LoginForm.js:61:8
         />
       </label>
       <br />
-      {error && <div style={{ color: "red" }}>{error}</div>}
+      {false}
       <button type="submit">Login</button>
     </form>
