[Survived] StringLiteral
src/pages/Consultas/ConsultasIBAN.js:6:36
 import { useState } from "react";
 
 function IBAN() {
-  const [iban, setIban] = useState("");
+  const [iban, setIban] = useState("Stryker was here!");
 
   function handleSubmit(event) {

[Survived] BlockStatement
src/pages/Consultas/ConsultasIBAN.js:8:32
 function IBAN() {
   const [iban, setIban] = useState("");
 
-  function handleSubmit(event) {
-    event.preventDefault();
-
-    // Aqui, pode se adicionar a lógica para buscar o IBAN do cliente na base de dados.
-    // e definir o valor de "iban" com o resultado da busca
-
-    setIban("PT50 1234 5678 9012 3456 7890 1");
-  }
+  function handleSubmit(event) {}
 
   return (

[Survived] StringLiteral
src/pages/Consultas/ConsultasIBAN.js:14:13
     // Aqui, pode se adicionar a lógica para buscar o IBAN do cliente na base de dados.
     // e definir o valor de "iban" com o resultado da busca
 
-    setIban("PT50 1234 5678 9012 3456 7890 1");
+    setIban("");
   }
 

[Survived] LogicalOperator
src/pages/Consultas/ConsultasIBAN.js:25:8
           See IBAN
         </button>
       </form>
-      {iban && (
-        <p className="success">
-          IBAN : {iban}
-        </p>
-      )}
+      {iban || <p className="success">
+          IBAN : {iban}
+        </p>}
     </div>
   );

[Survived] ConditionalExpression
src/pages/Consultas/ConsultasIBAN.js:25:8
           See IBAN
         </button>
       </form>
-      {iban && (
-        <p className="success">
-          IBAN : {iban}
-        </p>
-      )}
+      {false}
     </div>
   );
