[Survived] StringLiteral
src/pages/Consultas/ConsultasOrdem.js:6:54
 
 function MonthlyStatements() {
   // Define estado inicial para o mês e ano selecionado
-  const [selectedMonth, setSelectedMonth] = useState('January');
+  const [selectedMonth, setSelectedMonth] = useState("");
   const [selectedYear, setSelectedYear] = useState('2022');
   const [transactions, setTransactions] = useState([]);

[Survived] BlockStatement
src/pages/Consultas/ConsultasOrdem.js:10:19
   const [selectedYear, setSelectedYear] = useState('2022');
   const [transactions, setTransactions] = useState([]);
 
-  useEffect(() => {
-    fetchTransactions();
-  }, [selectedMonth, selectedYear]);
+  useEffect(() => {}, [selectedMonth, selectedYear]);
 
   const fetchTransactions = async () => {

[Survived] ArrayDeclaration
src/pages/Consultas/ConsultasOrdem.js:12:6
 
   useEffect(() => {
     fetchTransactions();
-  }, [selectedMonth, selectedYear]);
+  }, []);
 
   const fetchTransactions = async () => {

[Survived] BlockStatement
src/pages/Consultas/ConsultasOrdem.js:14:41
     fetchTransactions();
   }, [selectedMonth, selectedYear]);
 
-  const fetchTransactions = async () => {
-    // Fazer chamada a uma API ou servidor para obter as transações
-    const response = await fetch(`/api/transactions?month=${selectedMonth}&year=${selectedYear}`);
-    const data = await response.json();
-    setTransactions(data);
-  };
+  const fetchTransactions = async () => {};
 
   // Função para atualizar o mês selecionado

[Survived] BlockStatement
src/pages/Consultas/ConsultasOrdem.js:22:40
   };
 
   // Função para atualizar o mês selecionado
-  const handleMonthChange = (event) => {
-    setSelectedMonth(event.target.value);
-  };
+  const handleMonthChange = (event) => {};
 
   // Função para atualizar o ano selecionado

[Survived] BlockStatement
src/pages/Consultas/ConsultasOrdem.js:27:39
   };
 
   // Função para atualizar o ano selecionado
-  const handleYearChange = (event) => {
-    setSelectedYear(event.target.value);
-  };
+  const handleYearChange = (event) => {};
 
   return (

[Survived] LogicalOperator
src/pages/Consultas/ConsultasOrdem.js:61:8
         </select>
       </div>
       <button className="btn btn-primary" onClick={fetchTransactions}>View Statement</button>
-      {transactions.length > 0 && (
-        <ul>
-          {transactions.map((transaction) => (
-            <li key={transaction.id}>{transaction.description} - {transaction.amount}</li>
-          ))}
-        </ul>
-      )}
+      {transactions.length > 0 || <ul>
+          {transactions.map(transaction => <li key={transaction.id}>{transaction.description} - {transaction.amount}</li>)}
+        </ul>}
     </div>
   );

[Survived] EqualityOperator
src/pages/Consultas/ConsultasOrdem.js:61:8
         </select>
       </div>
       <button className="btn btn-primary" onClick={fetchTransactions}>View Statement</button>
-      {transactions.length > 0 && (
+      {transactions.length <= 0 && (
         <ul>
           {transactions.map((transaction) => (

[Survived] ArrowFunction
src/pages/Consultas/ConsultasOrdem.js:63:29
       <button className="btn btn-primary" onClick={fetchTransactions}>View Statement</button>
       {transactions.length > 0 && (
         <ul>
-          {transactions.map((transaction) => (
-            <li key={transaction.id}>{transaction.description} - {transaction.amount}</li>
-          ))}
+          {transactions.map(() => undefined)}
         </ul>
       )}

[Survived] BlockStatement
src/pages/Consultas/ConsultasOrdem.js:78:12
 export class Ordem extends Component {
   static displayName = Ordem.name;
 
-  render() {
-    return (
-      <div>
-        <MonthlyStatements />
-      </div>
-    );
-  }
+  render() {}
 }
