[Timeout] BlockStatement
src/pages/Login/LoginPage.js:7:22
 
 //É o handler do login correto ou errado 
 
-function LoginPage() {
-  const [isLoggedIn, setIsLoggedIn] = useState(false);
-
-  const handleLogin = () => {
-    setIsLoggedIn(true);
-  };
-
-  return (
-    <div>
-      {isLoggedIn ? (
-        <Main />
-      ) : (
-        <LoginForm handleLogin={handleLogin} />
-      )}
-    </div>
-  );
-}
+function LoginPage() {}
 
 export default LoginPage;

[Timeout] BooleanLiteral
src/pages/Login/LoginPage.js:8:48
 //É o handler do login correto ou errado 
 
 function LoginPage() {
-  const [isLoggedIn, setIsLoggedIn] = useState(false);
+  const [isLoggedIn, setIsLoggedIn] = useState(true);
 
   const handleLogin = () => {

[Timeout] BlockStatement
src/pages/Login/LoginPage.js:10:29
 function LoginPage() {
   const [isLoggedIn, setIsLoggedIn] = useState(false);
 
-  const handleLogin = () => {
-    setIsLoggedIn(true);
-  };
+  const handleLogin = () => {};
 
   return (

[Timeout] BooleanLiteral
src/pages/Login/LoginPage.js:11:19
   const [isLoggedIn, setIsLoggedIn] = useState(false);
 
   const handleLogin = () => {
-    setIsLoggedIn(true);
+    setIsLoggedIn(false);
   };
 
