[Timeout] BlockStatement
src/pages/Home/LogoutButton.js:4:54
 import React from "react";
 import PropTypes from "prop-types";
 
-const LogoutButton = ({ onLogout, redirectPath }) => {
-  const handleLogout = () => {
-    onLogout();
-    window.location.href = redirectPath;
-  };
-
-  return <button onClick={handleLogout}>Logout</button>;
-};
+const LogoutButton = ({ onLogout, redirectPath }) => {};
 
 LogoutButton.propTypes = {

[Timeout] BlockStatement
src/pages/Home/LogoutButton.js:5:30
 import PropTypes from "prop-types";
 
 const LogoutButton = ({ onLogout, redirectPath }) => {
-  const handleLogout = () => {
-    onLogout();
-    window.location.href = redirectPath;
-  };
+  const handleLogout = () => {};
 
   return <button onClick={handleLogout}>Logout</button>;

[Timeout] ObjectLiteral
src/pages/Home/LogoutButton.js:13:26
   return <button onClick={handleLogout}>Logout</button>;
 };
 
-LogoutButton.propTypes = {
-  onLogout: PropTypes.func.isRequired,
-  redirectPath: PropTypes.string.isRequired
-};
+LogoutButton.propTypes = {};
 
 export default LogoutButton;
