[Timeout] ObjectLiteral
src/_helpers/fake-backend.js:4:18
 export { fakeBackend };
 
 function fakeBackend() {
-    let users = [{ id: 1, username: 'test', password: 'test', firstName: 'Test', lastName: 'User' }];
+    let users = [{}];
     let realFetch = window.fetch;
     window.fetch = function (url, opts) {

[Timeout] StringLiteral
src/_helpers/fake-backend.js:4:55
 export { fakeBackend };
 
 function fakeBackend() {
-    let users = [{ id: 1, username: 'test', password: 'test', firstName: 'Test', lastName: 'User' }];
+    let users = [{ id: 1, username: 'test', password: "", firstName: 'Test', lastName: 'User' }];
     let realFetch = window.fetch;
     window.fetch = function (url, opts) {

[Timeout] BlockStatement
src/_helpers/fake-backend.js:11:36
             // wrap in timeout to simulate server api call
             setTimeout(handleRoute, 500);
 
-            function handleRoute() {
-                switch (true) {
-                    case url.endsWith('/users/authenticate') && opts.method === 'POST':
-                        return authenticate();
-                    case url.endsWith('/users') && opts.method === 'GET':
-                        return getUsers();
-                    default:
-                        // pass through any requests not handled above
-                        return realFetch(url, opts)
-                            .then(response => resolve(response))
-                            .catch(error => reject(error));
-                }
-            }
+            function handleRoute() {}
 
             // route functions

[Timeout] BooleanLiteral
src/_helpers/fake-backend.js:12:25
             setTimeout(handleRoute, 500);
 
             function handleRoute() {
-                switch (true) {
+                switch (false) {
                     case url.endsWith('/users/authenticate') && opts.method === 'POST':
                         return authenticate();

[Timeout] LogicalOperator
src/_helpers/fake-backend.js:13:26
 
             function handleRoute() {
                 switch (true) {
-                    case url.endsWith('/users/authenticate') && opts.method === 'POST':
+                    case url.endsWith('/users/authenticate') || opts.method === 'POST':
                         return authenticate();
                     case url.endsWith('/users') && opts.method === 'GET':

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:13:26
 
             function handleRoute() {
                 switch (true) {
-                    case url.endsWith('/users/authenticate') && opts.method === 'POST':
+                    case false:
                         return authenticate();
                     case url.endsWith('/users') && opts.method === 'GET':

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:15:21
                 switch (true) {
                     case url.endsWith('/users/authenticate') && opts.method === 'POST':
                         return authenticate();
-                    case url.endsWith('/users') && opts.method === 'GET':
-                        return getUsers();
+                    case url.endsWith('/users') && opts.method === 'GET':
                     default:
                         // pass through any requests not handled above

[Timeout] EqualityOperator
src/_helpers/fake-backend.js:15:52
                 switch (true) {
                     case url.endsWith('/users/authenticate') && opts.method === 'POST':
                         return authenticate();
-                    case url.endsWith('/users') && opts.method === 'GET':
+                    case url.endsWith('/users') && opts.method !== 'GET':
                         return getUsers();
                     default:

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:17:21
                         return authenticate();
                     case url.endsWith('/users') && opts.method === 'GET':
                         return getUsers();
-                    default:
-                        // pass through any requests not handled above
-                        return realFetch(url, opts)
-                            .then(response => resolve(response))
-                            .catch(error => reject(error));
+                    default:
                 }
             }

[Timeout] ArrowFunction
src/_helpers/fake-backend.js:20:35
                     default:
                         // pass through any requests not handled above
                         return realFetch(url, opts)
-                            .then(response => resolve(response))
+                            .then(() => undefined)
                             .catch(error => reject(error));
                 }

[Timeout] ArrowFunction
src/_helpers/fake-backend.js:21:36
                         // pass through any requests not handled above
                         return realFetch(url, opts)
                             .then(response => resolve(response))
-                            .catch(error => reject(error));
+                            .catch(() => undefined);
                 }
             }

[Timeout] BlockStatement
src/_helpers/fake-backend.js:27:37
 
             // route functions
 
-            function authenticate() {
-                const { username, password } = body();
-                const user = users.find(x => x.username === username && x.password === password);
-
-                if (!user) return error('Username or password is incorrect');
-
-                return ok({
-                    id: user.id,
-                    username: user.username,
-                    firstName: user.firstName,
-                    lastName: user.lastName,
-                    token: 'fake-jwt-token'
-                });
-            }
+            function authenticate() {}
 
             function getUsers() {

[Timeout] EqualityOperator
src/_helpers/fake-backend.js:29:46
 
             function authenticate() {
                 const { username, password } = body();
-                const user = users.find(x => x.username === username && x.password === password);
+                const user = users.find(x => x.username !== username && x.password === password);
 
                 if (!user) return error('Username or password is incorrect');

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:29:73
 
             function authenticate() {
                 const { username, password } = body();
-                const user = users.find(x => x.username === username && x.password === password);
+                const user = users.find(x => x.username === username && true);
 
                 if (!user) return error('Username or password is incorrect');

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:31:21
                 const { username, password } = body();
                 const user = users.find(x => x.username === username && x.password === password);
 
-                if (!user) return error('Username or password is incorrect');
+                if (false) return error('Username or password is incorrect');
 
                 return ok({

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:31:21
                 const { username, password } = body();
                 const user = users.find(x => x.username === username && x.password === password);
 
-                if (!user) return error('Username or password is incorrect');
+                if (true) return error('Username or password is incorrect');
 
                 return ok({

[Timeout] BlockStatement
src/_helpers/fake-backend.js:42:33
                 });
             }
 
-            function getUsers() {
-                if (!isAuthenticated()) return unauthorized();
-                return ok(users);
-            }
+            function getUsers() {}
 
             // helper functions

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:43:21
             }
 
             function getUsers() {
-                if (!isAuthenticated()) return unauthorized();
+                if (false) return unauthorized();
                 return ok(users);
             }

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:43:21
             }
 
             function getUsers() {
-                if (!isAuthenticated()) return unauthorized();
+                if (true) return unauthorized();
                 return ok(users);
             }

[Timeout] BlockStatement
src/_helpers/fake-backend.js:49:31
 
             // helper functions
 
-            function ok(body) {
-                resolve({ ok: true, text: () => Promise.resolve(JSON.stringify(body)) })
-            }
+            function ok(body) {}
 
             function unauthorized() {

[Timeout] BooleanLiteral
src/_helpers/fake-backend.js:50:31
             // helper functions
 
             function ok(body) {
-                resolve({ ok: true, text: () => Promise.resolve(JSON.stringify(body)) })
+                resolve({ ok: false, text: () => Promise.resolve(JSON.stringify(body)) })
             }
 

[Timeout] ArrowFunction
src/_helpers/fake-backend.js:50:43
             // helper functions
 
             function ok(body) {
-                resolve({ ok: true, text: () => Promise.resolve(JSON.stringify(body)) })
+                resolve({ ok: true, text: () => undefined })
             }
 

[Timeout] BlockStatement
src/_helpers/fake-backend.js:53:37
                 resolve({ ok: true, text: () => Promise.resolve(JSON.stringify(body)) })
             }
 
-            function unauthorized() {
-                resolve({ status: 401, text: () => Promise.resolve(JSON.stringify({ message: 'Unauthorized' })) })
-            }
+            function unauthorized() {}
 
             function error(message) {

[Timeout] ArrowFunction
src/_helpers/fake-backend.js:54:46
             }
 
             function unauthorized() {
-                resolve({ status: 401, text: () => Promise.resolve(JSON.stringify({ message: 'Unauthorized' })) })
+                resolve({ status: 401, text: () => undefined })
             }
 

[Timeout] BlockStatement
src/_helpers/fake-backend.js:57:37
                 resolve({ status: 401, text: () => Promise.resolve(JSON.stringify({ message: 'Unauthorized' })) })
             }
 
-            function error(message) {
-                resolve({ status: 400, text: () => Promise.resolve(JSON.stringify({ message })) })
-            }
+            function error(message) {}
 
             function isAuthenticated() {

[Timeout] ArrowFunction
src/_helpers/fake-backend.js:58:46
             }
 
             function error(message) {
-                resolve({ status: 400, text: () => Promise.resolve(JSON.stringify({ message })) })
+                resolve({ status: 400, text: () => undefined })
             }
 

[Timeout] BlockStatement
src/_helpers/fake-backend.js:61:40
                 resolve({ status: 400, text: () => Promise.resolve(JSON.stringify({ message })) })
             }
 
-            function isAuthenticated() {
-                return opts.headers['Authorization'] === 'Bearer fake-jwt-token';
-            }
+            function isAuthenticated() {}
 
             function body() {

[Timeout] EqualityOperator
src/_helpers/fake-backend.js:62:24
             }
 
             function isAuthenticated() {
-                return opts.headers['Authorization'] === 'Bearer fake-jwt-token';
+                return opts.headers['Authorization'] !== 'Bearer fake-jwt-token';
             }
 

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:62:24
             }
 
             function isAuthenticated() {
-                return opts.headers['Authorization'] === 'Bearer fake-jwt-token';
+                return false;
             }
 

[Timeout] BlockStatement
src/_helpers/fake-backend.js:65:29
                 return opts.headers['Authorization'] === 'Bearer fake-jwt-token';
             }
 
-            function body() {
-                return opts.body && JSON.parse(opts.body);    
-            }
+            function body() {}
         });
     }

[Timeout] ConditionalExpression
src/_helpers/fake-backend.js:66:24
             }
 
             function body() {
-                return opts.body && JSON.parse(opts.body);    
+                return true;    
             }
         });

[Timeout] LogicalOperator
src/_helpers/fake-backend.js:66:24
             }
 
             function body() {
-                return opts.body && JSON.parse(opts.body);    
+                return opts.body || JSON.parse(opts.body);    
             }
         });
