[Timeout] StringLiteral
src/pages/Transferencias/Transferencias.js:7:23
 
 
 function Transferencias(){
-  const fromAccount = "985632014521";
+  const fromAccount = "";
   const [toAccount, setToAccount] = useState("");
   const [amount, setAmount] = useState("");

[Timeout] BooleanLiteral
src/pages/Transferencias/Transferencias.js:10:64
   const fromAccount = "985632014521";
   const [toAccount, setToAccount] = useState("");
   const [amount, setAmount] = useState("");
-  const [showSuccessMessage, setShowSuccessMessage] = useState(false);
+  const [showSuccessMessage, setShowSuccessMessage] = useState(true);
   const [balance, setBalance] = useState(100000);
   const [transfers, setTransfers] = useState([

[Timeout] ObjectLiteral
src/pages/Transferencias/Transferencias.js:13:5
   const [showSuccessMessage, setShowSuccessMessage] = useState(false);
   const [balance, setBalance] = useState(100000);
   const [transfers, setTransfers] = useState([
-    {
-      fromAccount: "985632014521",
-      toAccount: "127456214563",
-      amount: 500,
-      date: "2023-03-03",
-    },
+    {},
     {
       fromAccount: "985632014521",

[Timeout] StringLiteral
src/pages/Transferencias/Transferencias.js:15:18
   const [transfers, setTransfers] = useState([
     {
       fromAccount: "985632014521",
-      toAccount: "127456214563",
+      toAccount: "",
       amount: 500,
       date: "2023-03-03",

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:30:9
   const handleTransfer = (event) => {
     event.preventDefault();
 
-    if (toAccount === fromAccount) {
+    if (true) {
       alert("You cannot transfer money to the same account.");
       return;

[Timeout] EqualityOperator
src/pages/Transferencias/Transferencias.js:30:9
   const handleTransfer = (event) => {
     event.preventDefault();
 
-    if (toAccount === fromAccount) {
+    if (toAccount !== fromAccount) {
       alert("You cannot transfer money to the same account.");
       return;

[Timeout] BlockStatement
src/pages/Transferencias/Transferencias.js:35:33
       return;
     }
 
-    if ( !toAccount || !amount) {
-      alert("Please fill in all fields");
-      return;
-    }
+    if ( !toAccount || !amount) {}
 
     const transferAmount = parseInt(amount);

[Timeout] LogicalOperator
src/pages/Transferencias/Transferencias.js:35:10
       return;
     }
 
-    if ( !toAccount || !amount) {
+    if ( !toAccount && !amount) {
       alert("Please fill in all fields");
       return;

[Timeout] EqualityOperator
src/pages/Transferencias/Transferencias.js:41:34
     }
 
     const transferAmount = parseInt(amount);
-    if (isNaN(transferAmount) || transferAmount <= 0) {
+    if (isNaN(transferAmount) || transferAmount < 0) {
       alert("Please enter a valid transfer amount");
       return;

[Timeout] EqualityOperator
src/pages/Transferencias/Transferencias.js:41:34
     }
 
     const transferAmount = parseInt(amount);
-    if (isNaN(transferAmount) || transferAmount <= 0) {
+    if (isNaN(transferAmount) || transferAmount > 0) {
       alert("Please enter a valid transfer amount");
       return;

[Timeout] StringLiteral
src/pages/Transferencias/Transferencias.js:42:13
 
     const transferAmount = parseInt(amount);
     if (isNaN(transferAmount) || transferAmount <= 0) {
-      alert("Please enter a valid transfer amount");
+      alert("");
       return;
     }

[Timeout] EqualityOperator
src/pages/Transferencias/Transferencias.js:46:9
       return;
     }
 
-    if (transferAmount > balance) {
+    if (transferAmount <= balance) {
       alert("You don't have enough balance for this transfer");
     } else {

[Timeout] BlockStatement
src/pages/Transferencias/Transferencias.js:46:35
       return;
     }
 
-    if (transferAmount > balance) {
-      alert("You don't have enough balance for this transfer");
-    } else {
+    if (transferAmount > balance) {} else {
       const date = new Date().toISOString().slice(0, 10);
       const newTransfer = {

[Timeout] BlockStatement
src/pages/Transferencias/Transferencias.js:48:12
 
     if (transferAmount > balance) {
       alert("You don't have enough balance for this transfer");
-    } else {
-      const date = new Date().toISOString().slice(0, 10);
-      const newTransfer = {
-        fromAccount,
-        toAccount,
-        amount: transferAmount,
-        date,
-      };
-      setTransfers([...transfers, newTransfer]);
-      setBalance(balance - transferAmount);
-      setShowSuccessMessage(true);
-      resetForm();
-    }
+    } else {}
   };
 

[Timeout] MethodExpression
src/pages/Transferencias/Transferencias.js:49:20
     if (transferAmount > balance) {
       alert("You don't have enough balance for this transfer");
     } else {
-      const date = new Date().toISOString().slice(0, 10);
+      const date = new Date().toISOString();
       const newTransfer = {
         fromAccount,

[Timeout] ArithmeticOperator
src/pages/Transferencias/Transferencias.js:57:18
         date,
       };
       setTransfers([...transfers, newTransfer]);
-      setBalance(balance - transferAmount);
+      setBalance(balance + transferAmount);
       setShowSuccessMessage(true);
       resetForm();

[Timeout] BooleanLiteral
src/pages/Transferencias/Transferencias.js:58:29
       };
       setTransfers([...transfers, newTransfer]);
       setBalance(balance - transferAmount);
-      setShowSuccessMessage(true);
+      setShowSuccessMessage(false);
       resetForm();
     }

[Timeout] BlockStatement
src/pages/Transferencias/Transferencias.js:63:27
     }
   };
 
-  const resetForm = () => {
-    
-    setToAccount("");
-    setAmount("");
-  };
+  const resetForm = () => {};
 
   const handleKeyPress = (event) => {

[Timeout] StringLiteral
src/pages/Transferencias/Transferencias.js:65:18
 
   const resetForm = () => {
     
-    setToAccount("");
+    setToAccount("Stryker was here!");
     setAmount("");
   };

[Timeout] BlockStatement
src/pages/Transferencias/Transferencias.js:69:37
     setAmount("");
   };
 
-  const handleKeyPress = (event) => {
-    const keyCode = event.keyCode || event.which;
-    const keyValue = String.fromCharCode(keyCode);
-    const regex = /^[0-9]*$/;
-    if (!regex.test(keyValue)) {
-      event.preventDefault();
-    }
-  };
+  const handleKeyPress = (event) => {};
 
   return (

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:70:21
   };
 
   const handleKeyPress = (event) => {
-    const keyCode = event.keyCode || event.which;
+    const keyCode = true;
     const keyValue = String.fromCharCode(keyCode);
     const regex = /^[0-9]*$/;

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:70:21
   };
 
   const handleKeyPress = (event) => {
-    const keyCode = event.keyCode || event.which;
+    const keyCode = false;
     const keyValue = String.fromCharCode(keyCode);
     const regex = /^[0-9]*$/;

[Timeout] Regex
src/pages/Transferencias/Transferencias.js:72:19
   const handleKeyPress = (event) => {
     const keyCode = event.keyCode || event.which;
     const keyValue = String.fromCharCode(keyCode);
-    const regex = /^[0-9]*$/;
+    const regex = /^[0-9]$/;
     if (!regex.test(keyValue)) {
       event.preventDefault();

[Timeout] Regex
src/pages/Transferencias/Transferencias.js:72:19
   const handleKeyPress = (event) => {
     const keyCode = event.keyCode || event.which;
     const keyValue = String.fromCharCode(keyCode);
-    const regex = /^[0-9]*$/;
+    const regex = /[0-9]*$/;
     if (!regex.test(keyValue)) {
       event.preventDefault();

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:73:9
     const keyCode = event.keyCode || event.which;
     const keyValue = String.fromCharCode(keyCode);
     const regex = /^[0-9]*$/;
-    if (!regex.test(keyValue)) {
+    if (true) {
       event.preventDefault();
     }

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:73:9
     const keyCode = event.keyCode || event.which;
     const keyValue = String.fromCharCode(keyCode);
     const regex = /^[0-9]*$/;
-    if (!regex.test(keyValue)) {
+    if (false) {
       event.preventDefault();
     }

[Timeout] ArrowFunction
src/pages/Transferencias/Transferencias.js:102:21
           id="toAccount"
           name="toAccount"
           value={toAccount}
-          onChange={(event) => setToAccount(event.target.value)}
+          onChange={() => undefined}
           onKeyPress={handleKeyPress}
           minLength={12}

[Timeout] ArrowFunction
src/pages/Transferencias/Transferencias.js:116:21
           id="amount"
           name="amount"
           value={amount}
-          onChange={(event) => setAmount(event.target.value)}
+          onChange={() => undefined}
           onKeyPress={handleKeyPress}
           maxLength={6}

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:125:8
 
         <button type="submit"><h3>Transfer</h3></button>
       </form>
-      {showSuccessMessage && (
-        <>
-          <p class="successful">Transfer successful! Check your account balance.</p>
-        </>
-      )}
+      {false}
         <h2>Transfer History</h2>
         <ul className="transfer-history">

[Timeout] ConditionalExpression
src/pages/Transferencias/Transferencias.js:125:8
 
         <button type="submit"><h3>Transfer</h3></button>
       </form>
-      {showSuccessMessage && (
-        <>
-          <p class="successful">Transfer successful! Check your account balance.</p>
-        </>
-      )}
+      {true}
         <h2>Transfer History</h2>
         <ul className="transfer-history">

[Timeout] ArrowFunction
src/pages/Transferencias/Transferencias.js:132:26
       )}
         <h2>Transfer History</h2>
         <ul className="transfer-history">
-          {transfers.map((transfer, index) => (
-            <li key={index}>
-              <p>From Account: {transfer.fromAccount}</p>
-              <p>To Account: {transfer.toAccount}</p>
-              <p>Amount: {transfer.amount}</p>
-              <p>Date: {transfer.date}</p>
-            </li>
-          ))}
+          {transfers.map(() => undefined)}
       </ul>
     </div>
