[Timeout] ObjectLiteral
src/_helpers/fetch-wrapper.js:3:29
 import { store, authActions } from '../_store';
 
-export const fetchWrapper = {
-    get: request('GET'),
-    post: request('POST'),
-    put: request('PUT'),
-    delete: request('DELETE')
-};
+export const fetchWrapper = {};
 
 function request(method) {

[Timeout] StringLiteral
src/_helpers/fetch-wrapper.js:4:18
 import { store, authActions } from '../_store';
 
 export const fetchWrapper = {
-    get: request('GET'),
+    get: request(""),
     post: request('POST'),
     put: request('PUT'),

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:10:26
     delete: request('DELETE')
 };
 
-function request(method) {
-    return (url, body) => {
-        const requestOptions = {
-            method,
-            headers: authHeader(url)
-        };
-        if (body) {
-            requestOptions.headers['Content-Type'] = 'application/json';
-            requestOptions.body = JSON.stringify(body);
-        }
-        return fetch(url, requestOptions).then(handleResponse);
-    }
-}
+function request(method) {}
 
 // helper functions

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:11:27
 };
 
 function request(method) {
-    return (url, body) => {
-        const requestOptions = {
-            method,
-            headers: authHeader(url)
-        };
-        if (body) {
-            requestOptions.headers['Content-Type'] = 'application/json';
-            requestOptions.body = JSON.stringify(body);
-        }
-        return fetch(url, requestOptions).then(handleResponse);
-    }
+    return (url, body) => {}
 }
 

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:16:19
             method,
             headers: authHeader(url)
         };
-        if (body) {
-            requestOptions.headers['Content-Type'] = 'application/json';
-            requestOptions.body = JSON.stringify(body);
-        }
+        if (body) {}
         return fetch(url, requestOptions).then(handleResponse);
     }

[Timeout] ConditionalExpression
src/_helpers/fetch-wrapper.js:16:13
             method,
             headers: authHeader(url)
         };
-        if (body) {
+        if (true) {
             requestOptions.headers['Content-Type'] = 'application/json';
             requestOptions.body = JSON.stringify(body);

[Timeout] StringLiteral
src/_helpers/fetch-wrapper.js:17:36
             headers: authHeader(url)
         };
         if (body) {
-            requestOptions.headers['Content-Type'] = 'application/json';
+            requestOptions.headers[""] = 'application/json';
             requestOptions.body = JSON.stringify(body);
         }

[Timeout] StringLiteral
src/_helpers/fetch-wrapper.js:17:54
             headers: authHeader(url)
         };
         if (body) {
-            requestOptions.headers['Content-Type'] = 'application/json';
+            requestOptions.headers['Content-Type'] = "";
             requestOptions.body = JSON.stringify(body);
         }

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:26:26
 
 // helper functions
 
-function authHeader(url) {
-    // return auth header with jwt if user is logged in and request is to the api url
-    const token = authToken();
-    const isLoggedIn = !!token;
-    const isApiUrl = url.startsWith("http://localhost:4000");
-    if (isLoggedIn && isApiUrl) {
-        return { Authorization: `Bearer ${token}` };
-    } else {
-        return {};
-    }
-}
+function authHeader(url) {}
 
 function authToken() {

[Timeout] BooleanLiteral
src/_helpers/fetch-wrapper.js:29:25
 function authHeader(url) {
     // return auth header with jwt if user is logged in and request is to the api url
     const token = authToken();
-    const isLoggedIn = !!token;
+    const isLoggedIn = !token;
     const isApiUrl = url.startsWith("http://localhost:4000");
     if (isLoggedIn && isApiUrl) {

[Timeout] MethodExpression
src/_helpers/fetch-wrapper.js:30:22
     // return auth header with jwt if user is logged in and request is to the api url
     const token = authToken();
     const isLoggedIn = !!token;
-    const isApiUrl = url.startsWith("http://localhost:4000");
+    const isApiUrl = url.endsWith("http://localhost:4000");
     if (isLoggedIn && isApiUrl) {
         return { Authorization: `Bearer ${token}` };

[Timeout] LogicalOperator
src/_helpers/fetch-wrapper.js:31:9
     const token = authToken();
     const isLoggedIn = !!token;
     const isApiUrl = url.startsWith("http://localhost:4000");
-    if (isLoggedIn && isApiUrl) {
+    if (isLoggedIn || isApiUrl) {
         return { Authorization: `Bearer ${token}` };
     } else {

[Timeout] ConditionalExpression
src/_helpers/fetch-wrapper.js:31:9
     const token = authToken();
     const isLoggedIn = !!token;
     const isApiUrl = url.startsWith("http://localhost:4000");
-    if (isLoggedIn && isApiUrl) {
+    if (true) {
         return { Authorization: `Bearer ${token}` };
     } else {

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:33:12
     const isApiUrl = url.startsWith("http://localhost:4000");
     if (isLoggedIn && isApiUrl) {
         return { Authorization: `Bearer ${token}` };
-    } else {
-        return {};
-    }
+    } else {}
 }
 

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:38:22
     }
 }
 
-function authToken() {
-    return store.getState().auth.user?.token;
-}
+function authToken() {}
 
 function handleResponse(response) {

[Timeout] OptionalChaining
src/_helpers/fetch-wrapper.js:39:12
 }
 
 function authToken() {
-    return store.getState().auth.user?.token;
+    return store.getState().auth.user.token;
 }
 

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:42:35
     return store.getState().auth.user?.token;
 }
 
-function handleResponse(response) {
-    return response.text().then(text => {
-        const data = text && JSON.parse(text);
-
-        if (!response.ok) {
-            if ([401, 403].includes(response.status) && authToken()) {
-                // auto logout if 401 Unauthorized or 403 Forbidden response returned from api
-                const logout = () => store.dispatch(authActions.logout());
-                logout();
-            }
-
-            const error = (data && data.message) || response.statusText;
-            return Promise.reject(error);
-        }
-
-        return data;
-    });
-}
+function handleResponse(response) {}

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:43:41
 }
 
 function handleResponse(response) {
-    return response.text().then(text => {
-        const data = text && JSON.parse(text);
-
-        if (!response.ok) {
-            if ([401, 403].includes(response.status) && authToken()) {
-                // auto logout if 401 Unauthorized or 403 Forbidden response returned from api
-                const logout = () => store.dispatch(authActions.logout());
-                logout();
-            }
-
-            const error = (data && data.message) || response.statusText;
-            return Promise.reject(error);
-        }
-
-        return data;
-    });
+    return response.text().then(text => {});
 }

[Timeout] ConditionalExpression
src/_helpers/fetch-wrapper.js:44:22
 
 function handleResponse(response) {
     return response.text().then(text => {
-        const data = text && JSON.parse(text);
+        const data = true;
 
         if (!response.ok) {

[Timeout] LogicalOperator
src/_helpers/fetch-wrapper.js:44:22
 
 function handleResponse(response) {
     return response.text().then(text => {
-        const data = text && JSON.parse(text);
+        const data = text || JSON.parse(text);
 
         if (!response.ok) {

[Timeout] BlockStatement
src/_helpers/fetch-wrapper.js:47:70
         const data = text && JSON.parse(text);
 
         if (!response.ok) {
-            if ([401, 403].includes(response.status) && authToken()) {
-                // auto logout if 401 Unauthorized or 403 Forbidden response returned from api
-                const logout = () => store.dispatch(authActions.logout());
-                logout();
-            }
+            if ([401, 403].includes(response.status) && authToken()) {}
 
             const error = (data && data.message) || response.statusText;

[Timeout] ConditionalExpression
src/_helpers/fetch-wrapper.js:47:17
         const data = text && JSON.parse(text);
 
         if (!response.ok) {
-            if ([401, 403].includes(response.status) && authToken()) {
+            if (true) {
                 // auto logout if 401 Unauthorized or 403 Forbidden response returned from api
                 const logout = () => store.dispatch(authActions.logout());

[Timeout] ArrowFunction
src/_helpers/fetch-wrapper.js:49:32
         if (!response.ok) {
             if ([401, 403].includes(response.status) && authToken()) {
                 // auto logout if 401 Unauthorized or 403 Forbidden response returned from api
-                const logout = () => store.dispatch(authActions.logout());
+                const logout = () => undefined;
                 logout();
             }

[Timeout] ConditionalExpression
src/_helpers/fetch-wrapper.js:53:27
                 logout();
             }
 
-            const error = (data && data.message) || response.statusText;
+            const error = true;
             return Promise.reject(error);
         }

[Timeout] LogicalOperator
src/_helpers/fetch-wrapper.js:53:27
                 logout();
             }
 
-            const error = (data && data.message) || response.statusText;
+            const error = data && data.message && response.statusText;
             return Promise.reject(error);
         }
