[Timeout] BlockStatement
src/_store/auth.slice.js:21:31
 
 // implementation
 
-function createInitialState() {
-    return {
-        // initialize state from local storage to enable user to stay logged in
-        user: JSON.parse(localStorage.getItem('user')),
-        error: null
-    }
-}
+function createInitialState() {}
 
 function createReducers() {

[Timeout] BlockStatement
src/_store/auth.slice.js:29:27
     }
 }
 
-function createReducers() {
-    return {
-        logout
-    };
-
-    function logout(state) {
-        state.user = null;
-        localStorage.removeItem('user');
-        history.navigate('/login');
-    }
-}
+function createReducers() {}
 
 function createExtraActions() {

[Timeout] BlockStatement
src/_store/auth.slice.js:34:28
         logout
     };
 
-    function logout(state) {
-        state.user = null;
-        localStorage.removeItem('user');
-        history.navigate('/login');
-    }
+    function logout(state) {}
 }
 

[Timeout] BlockStatement
src/_store/auth.slice.js:41:31
     }
 }
 
-function createExtraActions() {
-    const baseUrl = `http://localhost:4000/users`;
-
-    return {
-        login: login()
-    };    
-
-    function login() {
-        return createAsyncThunk(
-            `${name}/login`,
-            async ({ email, password }) => await fetchWrapper.post(`${baseUrl}/authenticate`, { email, password })
-        );
-    }
-}
+function createExtraActions() {}
 
 function createExtraReducers() {

[Timeout] StringLiteral
src/_store/auth.slice.js:42:21
 }
 
 function createExtraActions() {
-    const baseUrl = `http://localhost:4000/users`;
+    const baseUrl = ``;
 
     return {

[Timeout] ObjectLiteral
src/_store/auth.slice.js:44:12
 function createExtraActions() {
     const baseUrl = `http://localhost:4000/users`;
 
-    return {
-        login: login()
-    };    
+    return {};    
 
     function login() {

[Timeout] BlockStatement
src/_store/auth.slice.js:48:22
         login: login()
     };    
 
-    function login() {
-        return createAsyncThunk(
-            `${name}/login`,
-            async ({ email, password }) => await fetchWrapper.post(`${baseUrl}/authenticate`, { email, password })
-        );
-    }
+    function login() {}
 }
 

[Timeout] ArrowFunction
src/_store/auth.slice.js:51:13
     function login() {
         return createAsyncThunk(
             `${name}/login`,
-            async ({ email, password }) => await fetchWrapper.post(`${baseUrl}/authenticate`, { email, password })
+            () => undefined
         );
     }

[Timeout] ObjectLiteral
src/_store/auth.slice.js:57:12
 }
 
 function createExtraReducers() {
-    return {
-        ...login()
-    };
+    return {};
 
     function login() {

[Timeout] BlockStatement
src/_store/auth.slice.js:61:22
         ...login()
     };
 
-    function login() {
-        var { pending, fulfilled, rejected } = extraActions.login;
-        return {
-            [pending]: (state) => {
-                state.error = null;
-            },
-            [fulfilled]: (state, action) => {
-                const user = action.payload;
-                // store user details and jwt token in local storage to keep user logged in between page refreshes
-                localStorage.setItem('user', JSON.stringify(user));
-                state.user = user;
-
-                // get return url from location state or default to home page
-                const { from } = history.location.state || { from: { pathname: '/' } };
-                history.navigate(from);
-            },
-            [rejected]: (state, action) => {
-                state.error = action.error;
-            }
-        };
-    }
+    function login() {}
 }
 

[Timeout] BlockStatement
src/_store/auth.slice.js:64:35
     function login() {
         var { pending, fulfilled, rejected } = extraActions.login;
         return {
-            [pending]: (state) => {
-                state.error = null;
-            },
+            [pending]: (state) => {},
             [fulfilled]: (state, action) => {
                 const user = action.payload;

[Timeout] BlockStatement
src/_store/auth.slice.js:67:45
             [pending]: (state) => {
                 state.error = null;
             },
-            [fulfilled]: (state, action) => {
-                const user = action.payload;
-                // store user details and jwt token in local storage to keep user logged in between page refreshes
-                localStorage.setItem('user', JSON.stringify(user));
-                state.user = user;
-
-                // get return url from location state or default to home page
-                const { from } = history.location.state || { from: { pathname: '/' } };
-                history.navigate(from);
-            },
+            [fulfilled]: (state, action) => {},
             [rejected]: (state, action) => {
                 state.error = action.error;

[Timeout] ConditionalExpression
src/_store/auth.slice.js:74:34
                 state.user = user;
 
                 // get return url from location state or default to home page
-                const { from } = history.location.state || { from: { pathname: '/' } };
+                const { from } = false;
                 history.navigate(from);
             },

[Timeout] ConditionalExpression
src/_store/auth.slice.js:74:34
                 state.user = user;
 
                 // get return url from location state or default to home page
-                const { from } = history.location.state || { from: { pathname: '/' } };
+                const { from } = true;
                 history.navigate(from);
             },

[Timeout] BlockStatement
src/_store/auth.slice.js:77:44
                 const { from } = history.location.state || { from: { pathname: '/' } };
                 history.navigate(from);
             },
-            [rejected]: (state, action) => {
-                state.error = action.error;
-            }
+            [rejected]: (state, action) => {}
         };
     }
