[Timeout] ObjectLiteral
src/_helpers/history.js:2:24
 // custom history object to allow navigation outside react components
-export const history = {
-    navigate: null,
-    location: null
-};
+export const history = {};
