[Timeout] ObjectLiteral
src/_store/index.js:9:37
 export * from './auth.slice';
 export * from './users.slice';
 
-export const store = configureStore({
-    reducer: {
-        auth: authReducer,
-        users: usersReducer
-    },
-});
+export const store = configureStore({});

[Timeout] ObjectLiteral
src/_store/index.js:10:14
 export * from './users.slice';
 
 export const store = configureStore({
-    reducer: {
-        auth: authReducer,
-        users: usersReducer
-    },
+    reducer: {},
 });
