[Timeout] StringLiteral
src/_store/users.slice.js:7:14
 
 // create slice
 
-const name = 'users';
+const name = "";
 const initialState = createInitialState();
 const extraActions = createExtraActions();

[Timeout] BlockStatement
src/_store/users.slice.js:20:31
 
 // implementation
 
-function createInitialState() {
-    return {
-        users: {}
-    }
-}
+function createInitialState() {}
 
 function createExtraActions() {

[Timeout] BlockStatement
src/_store/users.slice.js:26:31
     }
 }
 
-function createExtraActions() {
-    const baseUrl = `${process.env.REACT_APP_API_URL}/users`;
-
-    return {
-        getAll: getAll()
-    };    
-
-    function getAll() {
-        return createAsyncThunk(
-            `${name}/getAll`,
-            async () => await fetchWrapper.get(baseUrl)
-        );
-    }
-}
+function createExtraActions() {}
 
 function createExtraReducers() {

[Timeout] BlockStatement
src/_store/users.slice.js:33:23
         getAll: getAll()
     };    
 
-    function getAll() {
-        return createAsyncThunk(
-            `${name}/getAll`,
-            async () => await fetchWrapper.get(baseUrl)
-        );
-    }
+    function getAll() {}
 }
 

[Timeout] ArrowFunction
src/_store/users.slice.js:36:13
     function getAll() {
         return createAsyncThunk(
             `${name}/getAll`,
-            async () => await fetchWrapper.get(baseUrl)
+            () => undefined
         );
     }

[Timeout] BlockStatement
src/_store/users.slice.js:41:32
     }
 }
 
-function createExtraReducers() {
-    return {
-        ...getAll()
-    };
-
-    function getAll() {
-        var { pending, fulfilled, rejected } = extraActions.getAll;
-        return {
-            [pending]: (state) => {
-                state.users = { loading: true };
-            },
-            [fulfilled]: (state, action) => {
-                state.users = action.payload;
-            },
-            [rejected]: (state, action) => {
-                state.users = { error: action.error };
-            }
-        };
-    }
-}
+function createExtraReducers() {}
 

[Timeout] ObjectLiteral
src/_store/users.slice.js:42:12
 }
 
 function createExtraReducers() {
-    return {
-        ...getAll()
-    };
+    return {};
 
     function getAll() {

[Timeout] BlockStatement
src/_store/users.slice.js:46:23
         ...getAll()
     };
 
-    function getAll() {
-        var { pending, fulfilled, rejected } = extraActions.getAll;
-        return {
-            [pending]: (state) => {
-                state.users = { loading: true };
-            },
-            [fulfilled]: (state, action) => {
-                state.users = action.payload;
-            },
-            [rejected]: (state, action) => {
-                state.users = { error: action.error };
-            }
-        };
-    }
+    function getAll() {}
 }
 

[Timeout] ObjectLiteral
src/_store/users.slice.js:48:16
 
     function getAll() {
         var { pending, fulfilled, rejected } = extraActions.getAll;
-        return {
-            [pending]: (state) => {
-                state.users = { loading: true };
-            },
-            [fulfilled]: (state, action) => {
-                state.users = action.payload;
-            },
-            [rejected]: (state, action) => {
-                state.users = { error: action.error };
-            }
-        };
+        return {};
     }
 }

[Timeout] BlockStatement
src/_store/users.slice.js:49:35
     function getAll() {
         var { pending, fulfilled, rejected } = extraActions.getAll;
         return {
-            [pending]: (state) => {
-                state.users = { loading: true };
-            },
+            [pending]: (state) => {},
             [fulfilled]: (state, action) => {
                 state.users = action.payload;

[Timeout] BooleanLiteral
src/_store/users.slice.js:50:42
         var { pending, fulfilled, rejected } = extraActions.getAll;
         return {
             [pending]: (state) => {
-                state.users = { loading: true };
+                state.users = { loading: false };
             },
             [fulfilled]: (state, action) => {

[Timeout] BlockStatement
src/_store/users.slice.js:52:45
             [pending]: (state) => {
                 state.users = { loading: true };
             },
-            [fulfilled]: (state, action) => {
-                state.users = action.payload;
-            },
+            [fulfilled]: (state, action) => {},
             [rejected]: (state, action) => {
                 state.users = { error: action.error };

[Survived] BlockStatement
src/_store/users.slice.js:55:44
             [fulfilled]: (state, action) => {
                 state.users = action.payload;
             },
-            [rejected]: (state, action) => {
-                state.users = { error: action.error };
-            }
+            [rejected]: (state, action) => {}
         };
     }
